# Scale Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCalculatorOptions..::..Scale Property
IFCExtrusionCalculatorOptions Class See Also
---
The scaling factor for length measurements from the default Revit units to the export units.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Scale { get; set; }
```

Visual Basic
---
```text
Public Property Scale As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Scale {
	double get ();
	void set (double value);
}
```

# See Also
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace